/*
   Localizable.strings - English
   modizer

   Organized by screens and feature families
*/

// ==================================
// MARK: - COMMON / GENERAL
// ==================================

/* Common Actions */
"Yes" = "예";
"No" = "아니오";
"Ok" = "확인";
"Cancel" = "취소";
"Close" = "닫기";
"Save" = "저장";
"Delete" = "삭제";
"Rename" = "이름 변경";
"Extract" = "압축 풀기";
"Cut" = "잘라내기";
"Paste" = "붙여넣기";
"Create" = "만들기";
"Reset" = "초기화";

/* Common States */
"Loading" = "로딩 중";
"Extracting" = "압축 푸는 중";
"Seeking" = "탐색 중";
"Seeking %d%%" = "탐색 중 %d%%";
"Refreshing" = "새로고침 중";
"Browsing" = "검색 중";
"Cancelling..." = "취소 중...";

/* Common Messages */
"Error" = "오류";
"OK" = "확인";
"Warning" = "경고";
"Do you want to reset to default value:\n" = "기본값으로 초기화하시겠습니까:\n";


// ==================================
// MARK: - BROWSER
// ==================================

/* Browser Main Keys */
"Browser_LocalBrowsing_MainKey" = "로컬 검색";
"Browser_LocalBrowsing_SubKey" = "로컬 파일 검색, 재생 및 삭제";

"Browser_MODLAND_MainKey" = "MODLAND 컬렉션";
"Browser_MODLAND_SubKey" = "%d개 다운로드 가능한 파일";

"Browser_HVSC_MainKey" = "HVSC 컬렉션";
"Browser_HVSC_SubKey" = "%d개 다운로드 가능한 파일";

"Browser_Playlists_MainKey" = "재생목록";
"Browser_Playlists_SubKey" = "재생목록 관리, 생성, 삭제 및 듣기";

"Browser_Favorites_MainKey" = "즐겨찾기";
"Browser_Favorites_SubKey" = "평가한 곡 듣기";

"Browser_Most_played_MainKey" = "가장 많이 재생됨";
"Browser_Most_played_SubKey" = "가장 많이 재생된 곡 듣기";

"Browser_Web_MainKey" = "웹";
"Browser_Web_SubKey" = "인터넷 검색 및 음악 다운로드";

"Browser_WorldCharts_MainKey" = "세계 차트";
"Browser_WorldCharts_SubKey" = "상위 목록 및 다운로드 링크";

"Browser_WebVGM_MainKey" = "VGMRips";
"Browser_WebVGM_SubKey" = "비디오 게임 음악 립";

"Browser_UserGuide_MainKey" = "사용자 가이드";
"Browser_UserGuide_SubKey" = "매뉴얼, FAQ, 팁";

/* Browser Display Modes */
"GetAllEntries_MainKey" = "누락된 항목 모두 가져오기";
"GetAllEntries_SubKey" = "처음 256개의 누락된 항목으로 제한됨";

"DisplayAll_MainKey" = "이름순으로 모두 나열";
"DisplayAll_SubKey" = "현재 디렉토리:";

"DisplayDir_MainKey" = "목록/디렉토리";
"DisplayDir_SubKey" = "경로순으로 모두 정렬:";

"DisplayAllPath_MainKey" = "경로순으로 모두 나열";
"DisplayAllPath_SubKey" = "이름순으로 모두 정렬:";

/* Browser View Modes */
"Formats/Artists/Files" = "형식/아티스트/파일";
"Artists/Formats/Files" = "아티스트/형식/파일";
"Artists/Files" = "아티스트/파일";
"Formats: %d entries." = "형식: %d개 항목";
"Artists: %d entries." = "아티스트: %d개 항목";

/* Browser Stats */
"Played %d times." = "%d회 재생됨";
"Played once." = "1회 재생됨";
"Never played." = "재생된 적 없음";
"%d files." = "%d개 파일";
"1 file." = "1개 파일";
"Size: %dKB" = "크기: %dKB";

/* Browser Messages */
"Browser not enough mem." = "항목이 너무 많아 메모리를 할당할 수 없습니다.";
"Browser not enough mem. Limited." = "항목이 너무 많아 메모리를 할당할 수 없습니다. 목록이 불완전합니다.";

/* File Operations */
"New folder" = "새 폴더";
"Enter folder name" = "폴더 이름 입력";
"Nothing to paste" = "붙여넣을 항목 없음";
"No file to extract or not supported archive format.\n" = "압축을 풀 파일이 없거나 지원되지 않는 압축 형식입니다.\n";
"Cannot use iCloud as folder name" = "iCloud를 폴더 이름으로 사용할 수 없습니다";

"Issue %d while trying to delete entry.\n%@" = "항목 삭제 시도 중 문제 %d 발생\n%@";
"Issue %d while trying to renamefile.\n%@" = "파일 이름 변경 시도 중 문제 %d 발생\n%@";
"Issue %d while moving: %@.\n%@" = "이동 중 문제 %d 발생: %@\n%@";
"Issue %d while creating folder\n%@" = "폴더 생성 중 문제 %d 발생\n%@";

"File is not available locally.\nTrigerring download from iCloud, please check in 'Files' application." = "파일이 로컬에 없습니다.\niCloud에서 다운로드를 시작합니다. '파일' 앱에서 확인하세요.";

"unavailable" = "사용 불가";

// ==================================
// MARK: - SEARCH
// ==================================

/* Search States */
"Playlist (%d)" = "재생목록 (%d)";
"Playlist/Search off" = "재생목록/검색 끔";

"Local (%d, limited to %d)" = "로컬 (%d, %d개로 제한)";
"Local (%d)" = "로컬 (%d)";
"Local/Search off" = "로컬/검색 끔";

"Modland (%d, limited to %d)" = "Modland (%d, %d개로 제한)";
"Modland (%d)" = "Modland (%d)";
"Modland/Search off" = "Modland/검색 끔";

"HVSC (%d, limited to %d)" = "HVSC (%d, %d개로 제한)";
"HVSC (%d)" = "HVSC (%d)";
"HVSC/Search off" = "HVSC/검색 끔";

"ASMA (%d, limited to %d)" = "ASMA (%d, %d개로 제한)";
"ASMA (%d)" = "ASMA (%d)";
"ASMA/Search off" = "ASMA/검색 끔";

/* Search Messages */
"Searching Playlists..." = "재생목록 검색 중...";
"Searching Local files..." = "로컬 파일 검색 중...";
"Searching MODLAND..." = "MODLAND 검색 중...";
"Searching HVSC..." = "HVSC 검색 중...";

"Please enter at least 2 characters for your search." = "검색을 위해 최소 2자를 입력하세요.";
"Please activate at least 1 section for your search." = "검색을 위해 최소 1개 섹션을 활성화하세요.";


// ==================================
// MARK: - PLAYER / NOW PLAYING
// ==================================

/* Player States */
"Now playing" = "지금 재생 중";
"Now playing(%d)" = "지금 재생 중(%d)";
"Most played" = "가장 많이 재생됨";
"Favorites" = "즐겨찾기";
"Resuming last\nplayed file" = "마지막 재생\n파일 재개";

/* Player Controls */
"Previous" = "이전";
"Previous file" = "이전 파일";
"Next file" = "다음 파일";
"Next" = "다음";
"Shuffle" = "셔플";
"Voices control" = "음성 제어";
"All voices" = "모든 음성";
"Clear 'Now Playing' queue" = "'지금 재생 중' 대기열 지우기";

/* Song Selection */
"Choose a subsong" = "서브송 선택";
"Choose a song" = "곡 선택";

/* Player Messages */
"Nothing currently playing. Please select a file." = "현재 재생 중인 항목이 없습니다. 파일을 선택하세요.";
"File cannot be played. Skipping to next playable file." = "파일을 재생할 수 없습니다. 다음 재생 가능한 파일로 건너뜁니다.";
"Too much entries! Playlist will be limited to %d first entries." = "항목이 너무 많습니다! 재생목록이 처음 %d개 항목으로 제한됩니다.";
"Playlist is full. Delete some entries to add more." = "재생목록이 가득 찼습니다. 더 추가하려면 일부 항목을 삭제하세요.";

/* Metadata */
"unknown_title" = "알 수 없는 제목";
"unknown_album" = "알 수 없는 앨범";
"now_playing_format" = "재생 중: %@ (출처: %@)";


// ==================================
// MARK: - PLAYLISTS
// ==================================

/* Playlist Actions */
"New playlist" = "새 재생목록";
"Create new playlist" = "새 재생목록 만들기";
"Save current one" = "현재 재생목록 저장";
"Rename playlist" = "재생목록 이름 변경";
"Add to a playlist" = "재생목록에 추가";
"Choose a playlist" = "재생목록 선택";

/* Playlist Descriptions */
"Create a new empty playlist." = "새로운 빈 재생목록을 만듭니다.";
"Create a playlist from currently played files." = "현재 재생된 파일로 재생목록을 만듭니다.";
"Browse files" = "파일 검색";
"Add or remove entries from browser." = "브라우저에서 항목 추가 또는 제거";
"Choose a new name." = "새 이름을 선택하세요.";

/* Playlist Confirmations */
"Are you sure you want to delete this playlist ?" = "이 재생목록을 삭제하시겠습니까?";
"Are you sure you want to delete this entry ?" = "이 항목을 삭제하시겠습니까?";


// ==================================
// MARK: - DOWNLOADS
// ==================================

"Downloads" = "다운로드";
"Download queue: 1 file" = "다운로드 대기열: 1개 파일";
"Download queue: %d files" = "다운로드 대기열: %d개 파일";
"No download in progress" = "진행 중인 다운로드 없음";
"Downloaded %@" = "%@ 다운로드됨";
"Downloading %@" = "%@ 다운로드 중";
"Cannot download from this URL." = "이 URL에서 다운로드할 수 없습니다.";
"Could not add files. Please check manually with file browser (Local Browsing/Downloads)." = "파일을 추가할 수 없습니다. 파일 브라우저(로컬 검색/다운로드)에서 수동으로 확인하세요.";
"File already available locally. Do you want to download it again?" = "파일이 이미 로컬에 있습니다. 다시 다운로드하시겠습니까?";
"URL have to start with ftp:// or http://" = "URL은 ftp:// 또는 http://로 시작해야 합니다";
"Cannot connect to FTP." = "FTP에 연결할 수 없습니다.";


// ==================================
// MARK: - DATABASE
// ==================================

"Database created." = "데이터베이스가 생성되었습니다.";
"Database will now be recreated. Please validate & wait." = "데이터베이스가 재생성됩니다. 확인하고 기다려 주세요.";
"Wrong database version: %d.%d. Will update to %d.%d. Please validate & wait." = "잘못된 데이터베이스 버전: %d.%d. %d.%d로 업데이트합니다. 확인하고 기다려 주세요.";
"No database found. Will create a new one. Please validate & wait..." = "데이터베이스를 찾을 수 없습니다. 새로 만듭니다. 확인하고 기다려 주세요...";


// ==================================
// MARK: - COVERS / IMAGES
// ==================================

"Image detected" = "이미지 감지됨";
"Choose_SaveCover" = "%@의 커버로 이미지를 저장하시겠습니까?";
"CoverFolder" = "폴더 커버로";
"CoverFile" = "파일 커버로";
"Confirm_RemCurCovers" = "%@의 현재 커버(폴더 및 파일)를 제거하시겠습니까?";


// ==================================
// MARK: - SETTINGS - GENERAL
// ==================================

/* Settings Sections */
"Settings_General" = "일반";
"Settings_Player" = "플레이어";
"Settings_Display" = "디스플레이";
"Settings_Download" = "다운로드";
"Settings_FTP" = "FTP";
"Settings_PlaybackLib" = "재생 라이브러리";
"Settings_Settings" = "설정";

/* Settings Presets */
"Settings_SettingsDefault" = "기본";
"Settings_SettingsHigh" = "높음";
"Settings_SettingsMed" = "중간";
"Settings_SettingsLow" = "낮음";

"Confirm_SettingsDef" = "설정을 '기본' 값으로 초기화하시겠습니까?";
"Confirm_SettingsHigh" = "설정을 '높음' 값으로 초기화하시겠습니까?";
"Confirm_SettingsMed" = "설정을 '중간' 값으로 초기화하시겠습니까?";
"Confirm_SettingsLow" = "설정을 '낮음' 값으로 초기화하시겠습니까?";

/* Global Player Settings */
"Search: simplified regexp ('.' -> '\\.', '*' -> '.*')" = "검색: 간소화된 정규식 ('.' -> '\\.', '*' -> '.*')";
"Resume position on launch" = "시작 시 위치 재개";
"Notification" = "알림";
"Notification duration" = "알림 지속 시간";
"Disable screen auto lock" = "화면 자동 잠금 비활성화";
"No screen auto lock" = "화면 자동 잠금 없음";
"Enable playback ratio" = "재생 비율 활성화";
"Playback ratio" = "재생 비율";
"Default length" = "기본 길이";
"Default length %d:%.2d" = "기본 길이 %d:%.2d";
"Fade-out time" = "페이드아웃 시간";
"Silence Detection" = "무음 감지";
"Stop song if silent for more than selected number of seconds. 0: off" = "선택한 초 이상 무음일 경우 곡 중지. 0: 끔";
"Will skip song if nothing is played for specified duration (0=off)" = "지정된 시간 동안 아무것도 재생되지 않으면 곡 건너뛰기 (0=끔)";
"Force mono" = "모노 강제";
"Panning" = "패닝";
"Panning value" = "패닝 값";
"Audio latency" = "오디오 지연";
"Audio latency in ms" = "오디오 지연 (ms)";
"Multi default action" = "다중 기본 동작";
"Browse" = "검색";
"Archive/multi play mode" = "압축 파일/다중 재생 모드";
"Entry" = "항목";

/* Archive Settings */
"Archive multi default action" = "압축 파일 다중 기본 동작";
"Archive multi play mode" = "압축 파일 다중 재생 모드";

/* Playlist Settings */
"Play/Enqueue action" = "재생/대기열 추가 동작";
"Enqueue mode" = "대기열 추가 모드";
"Default Action" = "기본 동작";
"Play" = "재생";
"Enqueue" = "대기열 추가";
"Enq.&Play" = "대기열 추가 및 재생";
"First" = "처음";
"Current" = "현재";
"Last" = "마지막";
"Enqueue position" = "대기열 추가 위치";
"Post download action" = "다운로드 후 동작";
"Nothing" = "없음";

/* Display Settings */
"Background mode" = "백그라운드 모드";
"Partial" = "부분";
"Full" = "전체";
"Off=no background process, Partial=keep playing music, Full=keep app on in background" = "끔=백그라운드 프로세스 없음, 부분=음악 재생 유지, 전체=백그라운드에서 앱 유지";
"Long name truncate" = "긴 이름 자르기";
"Head" = "앞부분";
"Mid." = "중간";
"Tail" = "뒷부분";
"Filename as title" = "파일 이름을 제목으로";

/* Local Files Settings */
"Auto. restore Samples folder" = "자동으로 Samples 폴더 복원";
"Send statistics" = "통계 전송";


// ==================================
// MARK: - SETTINGS - DATABASE
// ==================================

"Settings_DB" = "데이터베이스";
"Settings_CleanDB" = "데이터베이스 정리";
"Settings_ResetPlCnt" = "재생 횟수 초기화";
"Settings_ResetRatings" = "평가 초기화";
"Settings_ResetDB" = "전체 데이터베이스 초기화";

"Confirm_DBClean" = "데이터베이스 정리를 시작하시겠습니까 (시간이 걸릴 수 있음)?";
"Confirm_Reset_PlCnt" = "모든 재생 횟수를 초기화하시겠습니까?";
"Confirm_Reset_Ratings" = "모든 평가를 초기화하시겠습니까?";
"Confirm_ResetDB" = "전체 데이터베이스를 초기화하시겠습니까? 재생목록, 평가, 횟수가 삭제됩니다.";


// ==================================
// MARK: - SETTINGS - LOCAL FILES
// ==================================

"Settings_LocalFiles" = "로컬 파일";
"Settings_RecreateSamples" = "'Samples' 폴더 재생성";
"Settings_FormatDownloads" = "'Downloads' 폴더 포맷";
"Settings_RemCovers" = "커버 제거";
"Settings_UpdateFilesBackupFlag" = "파일시스템 확인";

"Confirm_RecreateSamples" = "'Samples' 폴더를 재생성하시겠습니까.";
"Confirm_FormatDownloads" = "로컬 검색/웹 폴더에서 모든 파일을 제거하시겠습니까.";
"Confirm_CheckFiles" = "로컬 파일시스템 확인을 수행하시겠습니까?";


// ==================================
// MARK: - SETTINGS - PLUGINS
// ==================================

/* Adplug */
"OPL type" = "OPL 유형";
"Stereo surround" = "스테레오 서라운드";

/* GBSPlay */
"HP filter type" = "HP 필터 유형";
"Highpass filter type" = "하이패스 필터 유형";

/* Game Music Emu (GME) */
"Stereo separation" = "스테레오 분리";
"Ignore silence" = "무음 무시";
"Silence detection" = "무음 감지";
"Equalizer" = "이퀄라이저";
"Bass" = "저음";
"Treble" = "고음";

/* GSF */
"Sound quality" = "음질";
"Interpolation" = "보간";
"Low-pass filter" = "로우패스 필터";
"Echo" = "에코";

/* Highly Complete (HC) */
"Resample quality" = "리샘플 품질";
"Main enabled" = "메인 활성화";
"Reverb enabled" = "리버브 활성화";

/* NSFPlay */
"NSFPLAY default length" = "NSFPLAY 기본 길이";
"LPF strength" = "LPF 강도";
"Min=off, default: 112" = "최소=끔, 기본값: 112";
"HPF strength" = "HPF 강도";
"Region" = "지역";
"VRC7 Patches" = "VRC7 패치";
"Force IRQ" = "IRQ 강제";
"Quality" = "품질";

/* OpenMPT */
"Master volume" = "마스터 볼륨";
"Sampling" = "샘플링";
"Resampling" = "리샘플링";

/* SID */
"Engine" = "엔진";
"Filter" = "필터";
"Force loop" = "루프 강제";
"Clock" = "클럭";
"Model" = "모델";
"Force 2nd SID" = "2번째 SID 강제";
"Address 2nd" = "2번째 주소";
"0xD420-0xD7FF or 0xDE00-0xDFFF" = "0xD420-0xD7FF 또는 0xDE00-0xDFFF";
"Force 3rd SID" = "3번째 SID 강제";
"Address 3rd" = "3번째 주소";
"Start subsong" = "서브송 시작";
"Subsong start position: first one or the one specified in file's header" = "서브송 시작 위치: 첫 번째 또는 파일 헤더에 지정된 것";
"Header" = "헤더";

/* Timidity */
"Max loop" = "최대 루프";
"MIDI polyphony" = "MIDI 폴리포니";
"Amplification" = "증폭";
"Chorus" = "코러스";
"Reverb" = "리버브";
"Resample" = "리샘플";
"LP filter" = "LP 필터";

/* UADE */
"Headphones" = "헤드폰";
"LED filter" = "LED 필터";
"Normalization" = "정규화";
"Post FX" = "포스트 FX";
"Panning" = "패닝";
"Panning value" = "패닝 값";
"Gain" = "게인";
"Gain value" = "게인 값";
"Force NTSC" = "NTSC 강제";

/* VGMPlay */
"Prefer JTAG" = "JTAG 선호";
"YM2612 emulator" = "YM2612 에뮬레이터";
"Nuked OPN2 option" = "Nuked OPN2 옵션";
"YMF262 emulator" = "YMF262 에뮬레이터";
"YM3812 emulator" = "YM3812 에뮬레이터";
"QSound emulator" = "QSound 에뮬레이터";
"RF5C68 emulator" = "RF5C68 에뮬레이터";

/* VGMStream */
"Max loop" = "최대 루프";

/* XMP */
"Amiga 500 Filter" = "Amiga 500 필터";


// ==================================
// MARK: - SETTINGS - VISUALIZATIONS
// ==================================

/* General FX */
"FX Alpha" = "FX 알파";
"FX Fullscreen" = "FX 전체화면";
"FX FPS" = "FX FPS";
"FX show info" = "FX 정보 표시";
"Tech Info" = "기술 정보";
"Show FPS and other infos (CPU, Resolution, ProjectM audio data)" = "FPS 및 기타 정보 표시 (CPU, 해상도, ProjectM 오디오 데이터)";
"FX Level of details" = "FX 세부 수준";
"Low" = "낮음";
"Med" = "중간";
"High" = "높음";
"Slow FX limit" = "느린 FX 제한";
"Deactivate FX if too slow." = "너무 느리면 FX 비활성화";
"Weak" = "약함";
"Strong" = "강함";
"Display song info" = "곡 정보 표시";
"When in fulllscreen, display song info when it changes. TL is Top Left, DR is Bottom Right, C is Center." = "전체화면에서 곡이 변경되면 정보 표시. TL은 왼쪽 위, DR은 오른쪽 아래, C는 중앙";

/* ProjectM */
"ProjectM settings" = "ProjectM 설정";
"ProjectM on/off" = "ProjectM 켜기/끄기";
"Show preset label" = "프리셋 레이블 표시";
"Auto switch presets mode" = "자동 프리셋 전환 모드";
"Lock preset" = "프리셋 잠금";
"Time between preset" = "프리셋 간 시간";
"Blend presets" = "프리셋 혼합";
"Blend time" = "혼합 시간";
"Bundled presets" = "번들 프리셋";
"Custom presets" = "사용자 정의 프리셋";
"Aspect ratio" = "화면 비율";
"Mesh size X" = "메시 크기 X";
"Mesh size Y" = "메시 크기 Y";
"Hard cut enabled" = "하드 컷 활성화";
"Hard cut min time" = "하드 컷 최소 시간";
"Hard cut sensitivity" = "하드 컷 감도";
"Beat sensitivity" = "비트 감도";
"Permissive mode" = "허용 모드";

/* Oscilloscope */
"Oscillo settings" = "오실로스코프 설정";
"FX mode" = "FX 모드";
"Show label" = "레이블 표시";
"Label font size" = "레이블 글꼴 크기";
"Show grid" = "그리드 표시";
"Grid color" = "그리드 색상";
"Line width" = "선 굵기";
"Mono color" = "모노 색상";
"Multi color set" = "다중 색상 세트";
"Reset all colors" = "모든 색상 초기화";
"Thin" = "얇음";
"Medium" = "중간";
"Thick" = "굵음";
"Beefy" = "매우 굵음";

/* Piano Roll / MIDI */
"Piano roll" = "피아노 롤";
"Activate Piano roll FX, standard or 'Synthesia' like" = "피아노 롤 FX 활성화, 표준 또는 'Synthesia' 스타일";
"Activate spark FX, colored or white" = "스파크 FX 활성화, 컬러 또는 흰색";
"Display voices labels" = "음성 레이블 표시";
"Display octaves labels" = "옥타브 레이블 표시";
"MIDI pattern" = "MIDI 패턴";
"MIDI cut line" = "MIDI 컷 라인";
"MIDI bar style" = "MIDI 바 스타일";
"MIDI bar vibrato" = "MIDI 바 비브라토";
"Piano 3D" = "피아노 3D";
"Piano cut line" = "피아노 컷 라인";
"Piano color mode" = "피아노 색상 모드";

/* Spectrum */
"3D spectrum" = "3D 스펙트럼";
"3D spectrum bloom" = "3D 스펙트럼 블룸";
"Spectrum" = "스펙트럼";
"3D landscape" = "3D 풍경";
"3D landscape bloom" = "3D 풍경 블룸";

/* MOD Pattern */
"MOD pattern" = "MOD 패턴";
"MOD pattern BG alpha" = "MOD 패턴 BG 알파";
"MOD pattern vol bar" = "MOD 패턴 볼륨 바";
"MOD pattern current line mode" = "MOD 패턴 현재 라인 모드";
"MOD pattern font" = "MOD 패턴 글꼴";
"MOD pattern font size" = "MOD 패턴 글꼴 크기";
"MOD pattern theme" = "MOD 패턴 테마";


// ==================================
// MARK: - WEB BROWSER
// ==================================

"Browser_Welcome_Message" = "<b>Modizer 웹 브라우저에 오신 것을 환영합니다!</b><br><br>위의 주소 표시줄을 사용하여 탐색하거나 북마크를 탐색하세요.<br><br>이미지를 커버로 사용하려면 길게 누르거나(iOS) 오른쪽 클릭(macOS)하여 클립보드에 복사하세요.";
"Bookmarks" = "북마크";


// ==================================
// MARK: - ABOUT
// ==================================

"About_Text" = "v4.6 © Yohann Magnien / YoyoFR\n\n연락처: mailto:modizerhelp@gmail.com\n웹: https://modizer.app\n\nModizer 로고 제작: Steve Miele\n\n지원되는 파일 형식/확장자 수: 1108.\n!PM!,003,04SW,208,2DX9,2PSF,2SF,2SFLIB,3DO,4,40A,40B,41A,4V,50A,60A,61A,669,800,9TAV,A2M,A2T,AAC,AAM,AAX,ABK,AC1,AC1D,ACB,ACM,ACX,ADL,ADLIB,ADM,ADP,ADPCM,ADPCMX,ADS,ADSC,ADW,ADX,AFC,AFS2,AGD,AGI,AGSC,AHV,AHX,AI,AIF,AIF-LOOP,AIFC,AIFCL,AIFF,AIFFL,AIX,AKB,AL,AL2,ALP,AMC,AMD,AMF,AMS,AMTS,AO,AON,AON4,AON8,AP,APC,APE,ARP,AS0,AS3M,AS4,ASC,ASD,ASF,ASR,ASS,AST,AT3,AT9,ATSL,ATSL3,ATSL4,ATX,AUD,AUS,AVAL,AVP,AWB,AWC,AY,B1S,BAF,BAKA,BAM,BANK,BAO,BAR,BCSTM,BCWAV,BD,BD3,BDS,BDSP,BFC,BFSTM,BFWAV,BFWAVNSMBU,BG00,BGM,BGW,BH2PCM,BIK,BIK2,BIKA,BIN,BK2,BLK,BMDX,BMF,BMS,BNK,BNM,BNS,BNSF,BO2,BP,BP3,BRSTM,BRSTMSPM,BSF,BSI,BSND,BSS,BTSND,BVG,BWAV,BYTES,C64,C67,CAF,CAPDSP,CBD2,CC3,CCC,CD,CFF,CFN,CHAN,CHI,CHK,CHP,CIN,CKB,CKD,CKS,CM,CM3,CMC,CMF,CMR,CMS,CNK,COP,CORE,CP,CPK,CPLX,CPS,CRB,CSB,CSMP,CTRL,CUS,CUST,CUSTOM,CVS,CWAV,CXS,D00,DA,DAT,DATA,DAX,DB,DBM,DCS,DCT,DDSP,DE2,DEC,DFM,DH,DI,DIGI,DIVA,DL,DLM1,DLM2,DLN,DLT,DL_DELI,DM0,DM1,DM2,DMC,DMF,DMM,DMO,DMSG,DMU,DMU2,DNS,DODA,DP,DR0,DRO,DS2,DSB,DSC,DSF,DSFLIB,DSM,DSP,DSPW,DSQ,DSR,DSS,DST,DSYM,DTK,DTM,DUM,DVI,DW,DWOLD,DXH,DZ,E4X,EA,EAM,EAS,EMFF,EMOD,EMS,EMSV6,ENM,ENO,ENS,ESV,ET1,EU,EUP,EX,EXA,EZW,FAG,FAR,FC,FC-BSI,FC-M,FC13,FC14,FC3,FC4,FCM,FDA,FDI,FFW,FILP,FLAC,FLX,FMB,FNK,FP,FRED,FSB,FST,FSV,FT,FTC,FUZ,FUZZ,FW,FWAV,FWSE,G1L,GAM,GAMPLUS,GBR,GBS,GBTS,GCA,GCM,GCUB,GCW,GDM,GENH,GIN,GLUE,GM,GMC,GMS,GOT,GRAY,GSB,GSF,GSFLIB,GT2,GTD,GTK,GTR,GV,GWM,GYM,H4M,HA2,HAB,HBT,HCA,HD,HDR,HES,HGC1,HIP,HIP7,HIPC,HIS,HMC,HN,HPS,HRM,HRP,HRT,HRT!,HSC,HSF,HSP,HSQ,HST,HVL,HWAS,HX2,HX3,HXC,HXD,HXG,HXX,IAB,IADP,ICE,IDMSF,IDSP,IDVI,IDWAV,IDXMA,IFS,IKM,ILD,IMA,IMC,IMF,IMS,IMX,INSTR,INS,INT,IS,IS14,IS20,ISB,ISD,ISWS,IT,IT1,ITL,IVAG,IVAUD,IVB,J2B,JAM,JBM,JC,JCB,JCBO,JD,JMF,JO,JOE,JP,JPN,JPND,JPO,JPOLD,JSTM,JT,KAT,KCES,KCEY,KEF,KEF7,KH,KM9,KNS,KOVS,KRAW,KRIS,KRS,KSM,KSS,KTAC,KTSL2ASBIN,KTSS,KVS,L,LAA,LAAC,LAIF,LAIFC,LAIFF,LASF,LAX,LBIN,LDS,LEG,LEP,LIN,LION,LIQ,LM0,LM1,LM2,LM3,LM4,LM5,LM6,LM7,LME,LMP3,LMP4,LOGG,LOPUS,LP,LPCM,LPK,LPS,LRMB,LSE,LSF,LSTM,LWAV,LZS,M,M15,M2,M3U,M4A,M4V,MA,MAB,MAD,MAP,MATX,MAX,MBM,MC,MC3,MCA,MCADPCM,MCG,MCMD,MCMD_ORG,MCO,MCR,MD,MDAT,MDI,MDL,MDS,MDSP,MDST,MDX,MDY,MED,MEXXMP,MFP,MG,MGS,MI4,MIB,MIC,MID,MIDI,MIHB,MINI2SF,MINIDSF,MINIGSF,MININCSF,MINIPSF,MINIPSF2,MINIQSF,MINISNSF,MINISSF,MINIUSF,MJB,MK2,MKF,MKII,MKIIO,MKJ,ML,MM4,MM8,MMCMP,MMD0,MMD1,MMD2,MMD3,MMD4,MMDC,MMS,MNSTR,MO3,MOD,MOD15,MOD15_MST,MOD15_ST-IV,MOD15_UST,MOD_ADSC4,MOD_COMP,MOD_DOC,MOD_FLT4,MOD_NTK,MOD_NTK1,MOD_NTK2,MOD_NTKAMP,MOGG,MOK,MON,MON_OLD,MP3,MP4,MPD,MPDSP,MPF,MPG,MPK,MPRO,MPT,MPTM,MS,MSA,MSADPCM,MSB,MSC,MSD,MSF,MSO,MSP,MSS,MSV,MSVP,MT2,MTA2,MTAF,MTK,MTM,MTP2,MTR,MUG,MUG2,MUL,MUPS,MUS,MUSC,MUSX,MW,MWV,MXST,MYSPD,MZ,N64,NAAC,NCSF,NCSFLIB,NDP,NDS,NGCA,NLSD,NOISEPACKER2,NOISEPACKER3,NOP,NP,NP1,NP2,NP3,NPS,NPSF,NR,NRU,NSF,NSFE,NSOPUS,NST,NTP,NTPK,NUB,NUB2,NUS3AUDIO,NUS3BANK,NWA,NWAV,NXA,OCTAMED,OGG,OGL,OKT,OKTA,OMU,ONE,OPI,OPUS,OPUSX,OPX,ORG,OSP,OSS,OTM,OVB,OVI,OXM,OZI,P,P00,P10,P21,P2BT,P30,P3D,P40A,P40B,P41A,P4X,P50A,P5A,P5X,P60,P60A,P61,P61A,P6X,P86,PAP,PAST,PCD,PCM,PDT,PDX,PFLT,PHA,PIN,PIS,PK,PLM,PLX,PM,PM0,PM01,PM1,PM10C,PM18A,PM2,PM20,PM4,PM40,PMB,PMZ,PNB,POLK,PONA,POS,POWT,PP10,PP20,PP21,PP30,PPC,PPK,PPM,PPS,PPZ,PR1,PR2,PRG,PROM,PRU,PRU1,PRU2,PRUN,PRUN1,PRUN2,PS,PS2STM,PSA,PSC,PSF,PSF2,PSF2LIB,PSFLIB,PSG,PSH,PSID,PSM,PSND,PSW,PT,PT1,PT2,PT3,PT36,PTCOP,PTM,PTTUNE,PUMA,PVI,PVP,PWR,PXA,PYG,PYGM,PYGMY,PZI,QC,QPA,QSF,QSFLIB,QTS,R,RAC,RAD,RAK,RAS,RAW,RH,RHO,RIFF,RIX,RJP,RK,RKB,RKV,RMT,RND,ROF,ROL,RPGMVO,RRDS,RSD,RSF,RSID,RSM,RSP,RSTM,RTM,RWAR,RWAV,RWS,RWSD,RWX,RXW,S-C,S14,S3M,S7G,S98,SA,SA-P,SA2,SAB,SAD,SAF,SAP,SAS,SAT,SA_OLD,SB,SB0,SB1,SB2,SB3,SB4,SB5,SB6,SB7,SBIN,SBK,SBR,SBV,SC,SC68,SCD,SCH,SCI,SCL,SCN,SCR,SCT,SCUMM,SD9,SDB,SDF,SDR,SDT,SEB,SED,SEG,SET,SF0,SF2,SFL,SFM,SFS,SFX,SFX13,SFX2,SG,SGB,SGC,SGD,SGX,SID,SID1,SID2,SJS,SKT,SKYT,SL3,SLI,SM,SM0,SM1,SM2,SM3,SM4,SM5,SM6,SM7,SMC,SMK,SMN,SMP,SMPL,SMPRO,SMUS,SMV,SND,SNDH,SNDMON,SNDS,SNG,SNGW,SNK,SNR,SNS,SNSF,SNSFLIB,SNT,SNT!,SNU,SNX,SOC,SOD,SOG,SON,SONGPLAY,SONIC,SOP,SPC,SPD,SPK,SPL,SPM,SPS,SPSD,SPW,SQD,SQT,SQX,SS,SS2,SSD,SSF,SSFLIB,SSM,SSS,ST,ST1,ST2,ST26,ST3,ST30,STAR,STC,STER,STK,STM,STMA,STP,STPK,STR,STREAM,STRM,STS,STX,SUN,SVAG,SVG,SVS,SWAG,SWAV,SWD,SWITCH_AUDIO,SX,SXD,SXD1,SXD2,SXD3,SYN,SYNMOD,SZX,TD0,TEC,TF,TF0,TFC,TFD,TFE,TFHD1.5,TFHD7V,TFHDPRO,TFMX,TFMX1.5,TFMX7V,TFMXPRO,TGQ,TGV,THM,THN,THP,THX,TINY,TK5,TLZ,TLZP,TM2,TM8,TMC,TME,TMX,TP,TP1,TP2,TP3,TPU,TRA,TRC,TRD,TRO,TRONIC,TRS,TS,TUN,TW,TWO,TXT,TXTP,TYDSP,UDS,UE4OPUS,ULT,ULW,UM3,UMX,UN2,UNIC,UNIC2,USF,USFLIB,UTK,UV,V0,V1,V2M,V2MZ,VA3,VAG,VAI,VAS,VAWX,VB,VB2,VBK,VDM,VDS,VGM,VGS,VGV,VGZ,VID,VIG,VIS,VMS,VOI,VP6,VPK,VS,VSF,VSS,VSV,VTX,VXN,WAA,WAC,WAD,WAF,WAM,WAS,WAV,WAVC,WAVE,WAVEBATCH,WAVM,WAY,WB,WB2,WBD,WD,WEM,WII,WLF,WMA,WMUS,WN,WOW,WP2,WPD,WSD,WSI,WSR,WUA,WV2,WV6,WVE,WVS,WVX,X,XA,XA2,XA30,XAD,XAG,XAN,XANN,XAU,XAV,XEN,XM,XMA,XMA2,XMD,XMF,XMS,XMU,XNA,XNB,XOPUS,XPK,XPS,XSE,XSEW,XSF,XSM,XSS,XVAG,XVAS,XWAV,XWB,XWC,XWM,XWMA,XWS,XWV,YDSP,YM,YMF,YMST,ZEN,ZIC,ZSD,ZSM,ZSS,ZWDSP,ZWV,ZXZIP\n통합 플레이어 라이브러리:\n- Adplug\n- Another Slight Atari Player(ASAP)\n- AtariSound\n- Eupmini\n- ffmpeg/mpg123/vorbis\n- Game Music Emu\n- FMPmini\n- Gbsplay\n- Highly Complete\n- AHX/Hively tracker\n- LazyUSF\n- Libvgm\n- Mdxplay\n- NSFPlay\n- OpenMPT\n- PlayGSF\n- Pmdmini\n- PxTone / Organya\n- PT3Player\n- SC68\n- Sibplayfp\n- Snes9x/snsf\n- ST-Sound\n- Timidity(Merlin_gold SF2 사운드폰트 사용)\n- UADE\n- XSF (2SF, NCSF)\n- XMP\n-V2M tinyplayer\n- VGMStream\n- VIO2SF\n- WebNEZ\n- WebSID\n- ZXTune\n\n면책 조항:\nModland, HVSC 및 ASMA 라이브러리에 대한 인터넷 액세스는 있는 그대로 제공되며 가용성 및/또는 기능에 대한 보증은 제공되지 않습니다. 본 애플리케이션 사용에 따른 책임은 사용자에게 있습니다.";


// ==================================
// MARK: - SUPPORT
// ==================================

"Mail support" = "이메일 지원";
"Contact support by email" = "이메일로 지원 팀에 문의";
"[Please describe your request below]" = "[아래에 요청 사항을 설명하세요]";


// ==================================
// MARK: - DONATION / TIPS
// ==================================

"Thank You! 🙏" = "감사합니다! 🙏";
"Send a tip to Modizer" = "Modizer에 팁 보내기";
"Support Modizer development" = "Modizer 개발 지원";


// ==================================
// MARK: - LAUNCH / INITIALIZATION
// ==================================

"Cleaning DB &\nreseting settings" = "DB 정리 및\n설정 초기화";
"First launch or issue encountered last time Modizer was running. Apply default settings?" = "처음 시작하거나 마지막 실행 시 문제가 발생했습니다. 기본 설정을 적용하시겠습니까?";


// ==================================
// MARK: - SIRI / APP INTENTS
// ==================================

/* Intent Titles */
"Play" = "재생";
"Pause" = "일시 정지";
"Stop" = "중지";
"Next Song" = "다음 곡";
"Previous Song" = "이전 곡";
"Play Subsong" = "서브송 재생";
"Seek" = "탐색";
"Set Infinite Loop" = "무한 루프 설정";
"Set Loop Mode" = "루프 모드 설정";
"Set Shuffle Mode" = "셔플 모드 설정";
"Toggle Shuffle" = "셔플 전환";
"Toggle Loop Mode" = "루프 모드 전환";
"Set Fullscreen mode" = "전체화면 모드 설정";
"Go the player view" = "플레이어 화면으로 이동";
"Set FX" = "FX 설정";
"Get Now Playing" = "지금 재생 중 가져오기";
"Get Playlists" = "재생목록 가져오기";
"Play some music" = "음악 재생";
"Play most played" = "가장 많이 재생된 곡 재생";
"Play favorites" = "즐겨찾기 재생";
"Play Playlist" = "재생목록 재생";
"Play Playlist By Name" = "이름으로 재생목록 재생";

/* Intent Descriptions */
"Starts playing music in Modizer." = "Modizer에서 음악 재생을 시작합니다.";
"Pauses music playback in Modizer." = "Modizer에서 음악 재생을 일시 정지합니다.";
"Stops music playback in Modizer." = "Modizer에서 음악 재생을 중지합니다.";
"Skips to the next song in Modizer." = "Modizer에서 다음 곡으로 건너뜁니다.";
"Skips to the previous song in Modizer." = "Modizer에서 이전 곡으로 건너뜁니다.";
"Plays a specific subsong in the current file." = "현재 파일의 특정 서브송을 재생합니다.";
"Seeks to a specific position in the current song." = "현재 곡의 특정 위치로 탐색합니다.";
"Set the infinite loop mode in Modizer." = "Modizer에서 무한 루프 모드를 설정합니다.";
"Set the loop mode in Modizer." = "Modizer에서 루프 모드를 설정합니다.";
"Set the shuffle mode in Modizer." = "Modizer에서 셔플 모드를 설정합니다.";
"Toggles shuffle mode in Modizer." = "Modizer에서 셔플 모드를 전환합니다.";
"Toggles loop mode in Modizer." = "Modizer에서 루프 모드를 전환합니다.";
"Set Fullscreen mode on or off in Modizer." = "Modizer에서 전체화면 모드를 켜거나 끕니다.";
"Go the player view in Modizer." = "Modizer에서 플레이어 화면으로 이동합니다.";
"Set FX mode in Modizer." = "Modizer에서 FX 모드를 설정합니다.";
"Gets information about the currently playing song." = "현재 재생 중인 곡에 대한 정보를 가져옵니다.";
"Gets the list of available playlists in Modizer." = "Modizer에서 사용 가능한 재생목록을 가져옵니다.";
"Random picks from available local titles in Modizer." = "Modizer의 사용 가능한 로컬 타이틀 중 무작위로 선택합니다.";
"Most played titles from available local titles in Modizer." = "Modizer의 사용 가능한 로컬 타이틀 중 가장 많이 재생된 곡입니다.";
"Favorites titles from available local titles in Modizer." = "Modizer의 사용 가능한 로컬 타이틀 중 즐겨찾기 곡입니다.";
"Plays a specific playlist in Modizer. Note: For best results with voice commands, use 'Play Playlist By Name' instead." = "Modizer에서 특정 재생목록을 재생합니다. 참고: 음성 명령의 최상의 결과를 위해 '이름으로 재생목록 재생'을 대신 사용하세요.";
"Plays a playlist by name in Modizer. Recommended for voice commands." = "Modizer에서 이름으로 재생목록을 재생합니다. 음성 명령에 권장됩니다.";

/* Parameters */
"Subsong Index" = "서브송 인덱스";
"The index of the subsong to play" = "재생할 서브송의 인덱스";
"Position (seconds)" = "위치 (초)";
"The position to seek to in seconds" = "탐색할 위치 (초)";
"Relative" = "상대적";
"Whether to seek relative to current position" = "현재 위치를 기준으로 탐색할지 여부";
"Infinite Loop Mode" = "무한 루프 모드";
"0: off, 1: infinite loop" = "0: 끔, 1: 무한 루프";
"Repeat Mode" = "반복 모드";
"0: off, 1: loop current title, 2: loop playlist" = "0: 끔, 1: 현재 곡 반복, 2: 재생목록 반복";
"Shuffle Mode" = "셔플 모드";
"0: off, 1: choose only one title if file has subsongs or is an archive, 2: play all titles of a given file" = "0: 끔, 1: 파일에 서브송이 있거나 압축 파일인 경우 하나만 선택, 2: 주어진 파일의 모든 곡 재생";
"Fullscreen mode" = "전체화면 모드";
"Activate (1) or disactivate (0) Fullscreen mode" = "전체화면 모드 활성화(1) 또는 비활성화(0)";
"FX" = "FX";
"The FX to set" = "설정할 FX";
"FX Mode" = "FX 모드";
"The mode to activate for the selected FX (0:off)" = "선택한 FX에 대해 활성화할 모드 (0:끔)";
"Playlist" = "재생목록";
"The playlist to play" = "재생할 재생목록";
"Start Index" = "시작 인덱스";
"The index of the song to start playing from (0-based)" = "재생을 시작할 곡의 인덱스 (0 기반)";
"Playlist Name" = "재생목록 이름";
"The name of the playlist to play" = "재생할 재생목록의 이름";
"Which playlist would you like to play?" = "어떤 재생목록을 재생하시겠습니까?";

/* Dialog Messages */
"play_playlist_dialog" = "재생목록 %@ 재생 중";
"Playlist not found. Use 'Get Playlists' to see available playlists." = "재생목록을 찾을 수 없습니다. '재생목록 가져오기'를 사용하여 사용 가능한 재생목록을 확인하세요.";
"No playlists found" = "재생목록을 찾을 수 없음";

/* FX Names */
"ProjectM" = "ProjectM";
"Oscillo" = "오실로스코프";
"Piano roll" = "피아노 롤";
"3D Piano" = "3D 피아노";
"Notes bars" = "음표 바";
"Tracker" = "트래커";
"2D Spectrum" = "2D 스펙트럼";
"3D Spectrum" = "3D 스펙트럼";
"3D Landscape" = "3D 풍경";

// ==================================


// ================================
// MARK: - VOICE COMMANDS UI
// ================================

"Voice Commands" = "음성 명령";
"Siri voice commands for Modizer" = "Modizer용 Siri 음성 명령";
"Voice Commands: Playback" = "재생";
"Voice Commands: Navigation" = "탐색";
"Voice Commands: Playlists" = "재생 목록";
"Voice Commands: Modes" = "모드";
// MARK: - TABS
// ==================================

"Search" = "검색";
"More" = "더 보기";
"Suspend" = "일시 중단";
"Clear all" = "모두 지우기";
"Online" = "온라인";


// ==================================
// MARK: - MORE TAB
// ==================================

"About" = "정보";
"Some general informations" = "일반 정보";
"Settings" = "설정";
"Global, Visu, FTP & Plugins" = "전체, 시각화, FTP 및 플러그인";
"Maintenance" = "유지보수";
"Clean DB, Reset ratings, ..." = "DB 정리, 평가 초기화, ...";


// ==================================
// MARK: - ONLINE TAB / COLLECTIONS
// ==================================

/* Section Headers */
"Collections" = "컬렉션";
"Browse Internet" = "인터넷 검색";
"Games Music" = "게임 음악";
"Mods & chiptunes" = "모드 및 칩튠";
"Other" = "기타";

/* Collections */
"MODLAND collection" = "MODLAND 컬렉션";
"AMP collection" = "AMP 컬렉션";
"HVSC collection" = "HVSC 컬렉션";
"ASMA collection" = "ASMA 컬렉션";
"JOSHW collection" = "JOSHW 컬렉션";
"VGMRips collection" = "VGMRips 컬렉션";
"SNESmusic collection" = "SNESmusic 컬렉션";
"SMS Power! collection" = "SMS Power! 컬렉션";
"ZXArt collection" = "ZXArt 컬렉션";

/* Collection Descriptions */
"%d entries" = "%d개 항목";
"Thousands of entries" = "수천 개의 항목";
"4K+ packs / 70K+ songs" = "4K+ 팩 / 70K+ 곡";
"1500+ sets / Super Nintendo/Famicom" = "1500+ 세트 / 슈퍼 닌텐도/패미컴";
"Master System & Game gear sets" = "마스터 시스템 및 게임 기어 세트";
"ZX Spectrum" = "ZX 스펙트럼";

/* Internet */
"Modizer World Charts" = "Modizer 세계 차트";
"Web browser" = "웹 브라우저";
"No internet connectivity or website down." = "인터넷 연결 없음 또는 웹사이트 다운됨";

// ==================================
// MARK: - SETTINGS - FAMILIES & UI
// ==================================

/* Settings Families */
"Global" = "전체";
"Default Players" = "기본 플레이어";
"Visualizers" = "시각화";
"PR & NS colors settings" = "PR 및 NS 색상 설정";
"Plugins" = "플러그인";

/* Player Selection */
"MOD player" = "MOD 플레이어";
"SAP player" = "SAP 플레이어";
"SID player" = "SID 플레이어";
"VGM player" = "VGM 플레이어";
"YM player" = "YM 플레이어";
"NSF player" = "NSF 플레이어";
"PT3 player" = "PT3 플레이어";
"GBS player" = "GBS 플레이어";
"KSS player" = "KSS 플레이어";
"2SF player" = "2SF 플레이어";
"MIDI player" = "MIDI 플레이어";

/* Global Player Settings - Additional Descriptions */
"Only for plugins supporting this feature (GME, NSFPLAY, LIBVGM)" = "이 기능을 지원하는 플러그인만 해당 (GME, NSFPLAY, LIBVGM)";
"0=auto, delay rounded to a multiple of audio buffer size" = "0=자동, 오디오 버퍼 크기의 배수로 반올림된 지연";
"Limited: not for subsong" = "제한: 서브송 제외";
"Default value is 3s" = "기본값 3초";
"Default action when selecting an archive or a multisong file" = "압축 파일 또는 다중 곡 파일 선택 시 기본 동작";
"Play only selected entry or full archive/multisong file" = "선택한 항목만 재생 또는 전체 압축 파일/다중 곡 파일 재생";
"Show Welcome screen" = "환영 화면 표시";
"Adplug priority for module" = "모듈용 Adplug 우선순위";

/* FTP Settings */
"Server status" = "서버 상태";
"FTP Server" = "FTP 서버";
"Authorize anonymous" = "익명 허용";
"User" = "사용자";
"Password" = "비밀번호";
"Port" = "포트";

/* Online Settings */
"MODLAND URL" = "MODLAND URL";
"HVSC URL" = "HVSC URL";
"ASMA URL" = "ASMA URL";
"MODLAND Server" = "MODLAND 서버";
"MODLAND cust.URL" = "MODLAND 사용자 정의 URL";
"HVSC Server" = "HVSC 서버";
"HVSC cust.URL" = "HVSC 사용자 정의 URL";
"ASMA Server" = "ASMA 서버";
"ASMA cust.URL" = "ASMA 사용자 정의 URL";


// ==================================
// MARK: - SETTINGS - ADDITIONAL PLUGIN SETTINGS
// ==================================

/* Visualization - MOD Pattern */
"Patterns BG Alpha" = "패턴 BG 알파";
"Opacity of mod patterns view" = "모드 패턴 뷰의 불투명도";
"MOD Color Theme" = "MOD 색상 테마";
"MOD Current Line" = "MOD 현재 라인";
"MOD Volume bars" = "MOD 볼륨 바";
"MOD Pattern Font" = "MOD 패턴 글꼴";
"MOD Pattern Font Size" = "MOD 패턴 글꼴 크기";

/* Visualization - Piano Roll / MIDI */
"Piano Roll FX" = "피아노 롤 FX";
"PR/Spark FX" = "PR/스파크 FX";
"Display voices label" = "음성 레이블 표시";
"Notes scroller FX" = "음표 스크롤 FX";
"NS/bars mode" = "NS/바 모드";
"NS/bars style" = "NS/바 스타일";
"Vibrato display" = "비브라토 표시";
"Piano FX" = "피아노 FX";
"Piano bars mode" = "피아노 바 모드";

/* Visualization - Spectrum */
"3D Sp.Bloom" = "3D 스펙트럼 블룸";
"3D Land. Bloom" = "3D 풍경 블룸";
"0: off" = "0: 끔";

/* ProjectM Settings */
"ProjectM FX" = "ProjectM FX";
"Rendering quality: Max is pixel resolution, 1/2 is half, ..." = "렌더링 품질: 최대는 픽셀 해상도, 1/2은 절반, ...";
"Custom presets/textures should be copied in .projectm folder" = "사용자 정의 프리셋/텍스처는 .projectm 폴더에 복사해야 함";
"Display preset name" = "프리셋 이름 표시";
"Lim: display and disappear quickly" = "제한: 빠르게 표시하고 사라짐";
"Auto switch presets" = "자동 프리셋 전환";
"Allow loading of milk file with script issues" = "스크립트 문제가 있는 milk 파일 로드 허용";
"Default is 15s" = "기본값 15초";
"Default is 2.7s" = "기본값 2.7초";
"Default value is 32" = "기본값 32";
"Default value is 24" = "기본값 24";
"Default value is 20" = "기본값 20";
"Hardcut" = "하드컷";
"Hardcut triggers presets switch synchronized with beats." = "하드컷은 비트와 동기화된 프리셋 전환을 트리거합니다.";
"Hardcut min time" = "하드컷 최소 시간";
"Preserve aspect ratio for compatible shaders." = "호환 가능한 셰이더의 화면 비율 유지";
"Default value is 1" = "기본값 1";
"Hardcut sensitivity" = "하드컷 감도";

/* Oscilloscope Settings */
"Oscillo FX" = "오실로스코프 FX";
"Oscillo show labels" = "오실로스코프 레이블 표시";
"Oscillo labels font size" = "오실로스코프 레이블 글꼴 크기";
"Oscillo show grid" = "오실로스코프 그리드 표시";
"Oscillo line width" = "오실로스코프 선 굵기";
"Reset all custom colors" = "모든 사용자 정의 색상 초기화";
"Multi color | System 1" = "다중 색상 | 시스템 1";
"Multi color | System 2" = "다중 색상 | 시스템 2";
"Multi color | System 3" = "다중 색상 | 시스템 3";
"Multi color | System 4" = "다중 색상 | 시스템 4";
"Multi color | System 5" = "다중 색상 | 시스템 5";
"Multi color | System 6" = "다중 색상 | 시스템 6";
"Multi color | System 7" = "다중 색상 | 시스템 7";
"Multi color | System 8" = "다중 색상 | 시스템 8";

/* Piano/MIDI Colors */
"Custom color 01" = "사용자 정의 색상 01";
"Custom color 02" = "사용자 정의 색상 02";
"Custom color 03" = "사용자 정의 색상 03";
"Custom color 04" = "사용자 정의 색상 04";
"Custom color 05" = "사용자 정의 색상 05";
"Custom color 06" = "사용자 정의 색상 06";
"Custom color 07" = "사용자 정의 색상 07";
"Custom color 08" = "사용자 정의 색상 08";
"Custom color 09" = "사용자 정의 색상 09";
"Custom color 10" = "사용자 정의 색상 10";
"Custom color 11" = "사용자 정의 색상 11";
"Custom color 12" = "사용자 정의 색상 12";
"Custom color 13" = "사용자 정의 색상 13";
"Custom color 14" = "사용자 정의 색상 14";
"Custom color 15" = "사용자 정의 색상 15";
"Custom color 16" = "사용자 정의 색상 16";
"Custom color 17" = "사용자 정의 색상 17";
"Custom color 18" = "사용자 정의 색상 18";
"Custom color 19" = "사용자 정의 색상 19";
"Custom color 20" = "사용자 정의 색상 20";
"Custom color 21" = "사용자 정의 색상 21";
"Custom color 22" = "사용자 정의 색상 22";
"Custom color 23" = "사용자 정의 색상 23";
"Custom color 24" = "사용자 정의 색상 24";
"Custom color 25" = "사용자 정의 색상 25";
"Custom color 26" = "사용자 정의 색상 26";
"Custom color 27" = "사용자 정의 색상 27";
"Custom color 28" = "사용자 정의 색상 28";
"Custom color 29" = "사용자 정의 색상 29";
"Custom color 30" = "사용자 정의 색상 30";
"Custom color 31" = "사용자 정의 색상 31";
"Custom color 32" = "사용자 정의 색상 32";

/* Plugin Settings - Libopenmpt */
"Libopenmpt" = "Libopenmpt";

/* Plugin Settings - GME */
"GME" = "GME";
"Will skip song if nothing is played for specified duration (0=off)" = "지정된 시간 동안 아무것도 재생되지 않으면 곡 건너뛰기 (0=끔)";

/* Plugin Settings - GSF */
"GSF" = "GSF";

/* Plugin Settings - NSFPLAY */
"NSFPLAY" = "NSFPLAY";
"Default length" = "기본 길이";
"Oversampling. Min=0, default: 10" = "오버샘플링. 최소=0, 기본값: 10";
"Min=off, default: 112" = "최소=끔, 기본값: 112";
"Max=off, default: 164" = "최대=끔, 기본값: 164";
"1/2/3=NTSC/PAL/DENDY\n4/5/6=force NTSC/PAL/DENDY" = "1/2/3=NTSC/PAL/DENDY\n4/5/6=강제 NTSC/PAL/DENDY";
"Forces IRQ capability for all NSFs, not just NSF2" = "모든 NSF에 대해 IRQ 기능 강제, NSF2만 해당하지 않음";
"APU unmute on reset" = "재설정 시 APU 음소거 해제";
"APU phase reset" = "APU 위상 재설정";
"APU non linear mixing" = "APU 비선형 믹싱";
"APU swap duty 1/2" = "APU 듀티 1/2 교체";
"APU Initialize sweep unmute" = "APU 스위프 음소거 해제 초기화";
"DMC enable $4011 writes" = "DMC $4011 쓰기 활성화";
"DMC enable periodic noise" = "DMC 주기적 노이즈 활성화";
"DMC unmute on reset" = "재설정 시 DMC 음소거 해제";
"DMC anti clicking" = "DMC 안티 클릭";
"DMC non linear mixer" = "DMC 비선형 믹서";
"DMC randomize noise on reset" = "재설정 시 DMC 노이즈 무작위화";
"DMC mute triangle on pitch 0" = "피치 0에서 DMC 삼각파 음소거";
"prevents high frequency aliasing" = "고주파 앨리어싱 방지";
"DMC rand. triangle" = "DMC 무작위 삼각파";
"randomize triangle on reset" = "재설정 시 삼각파 무작위화";
"DMC reverse bits" = "DMC 비트 역전";
"reverse bits of DPCM sample bytes" = "DPCM 샘플 바이트의 비트 역전";
"MMC5 non linear mixing" = "MMC5 비선형 믹싱";
"MMC5 Phase reset" = "MMC5 위상 재설정";
"Reset phase counter after write $5003 and $5007" = "$5003 및 $5007 쓰기 후 위상 카운터 재설정";
"FDS LP filter in Hz" = "FDS LP 필터 (Hz)";
"Cutoff frequency (0Hz=off, 2000Hz=default)" = "차단 주파수 (0Hz=끔, 2000Hz=기본값)";
"FDS reset \"phase\"" = "FDS \"위상\" 재설정";
"$4085 \"resets\" modular phase" = "$4085 모듈러 위상 \"재설정\"";
"FDS write protect" = "FDS 쓰기 보호";
"write protect $8000-DFFF" = "$8000-DFFF 쓰기 보호";
"VRC7 Replace with OPLL" = "VRC7을 OPLL로 교체";
"N163 Serial Multiplex mixing" = "N163 직렬 다중화 믹싱";
"N163 Write Protect Phase" = "N163 쓰기 보호 위상";
"N163 Limit Wavelength" = "N163 파장 제한";

/* Plugin Settings - ADPLUG */
"ADPLUG" = "ADPLUG";

/* Plugin Settings - HC (Highly Complete) */
"HC" = "HC";
"Only for HC plugin" = "HC 플러그인만 해당";

/* Plugin Settings - SID */
"SID" = "SID";
"Digiboost" = "디지부스트";

/* Plugin Settings - TIMIDITY */
"TIMIDITY" = "TIMIDITY";

/* Plugin Settings - UADE */
"UADE" = "UADE";
"Panning value" = "패닝 값";
"Gain value" = "게인 값";

/* Plugin Settings - VGMPlay */
"VGMPLAY" = "VGMPLAY";

/* Plugin Settings - VGMStream */
"VGMSTREAM" = "VGMSTREAM";

/* Plugin Settings - XMP */
"XMP" = "XMP";

/* Plugin Settings - SEXYPSF */
"SEXYPSF" = "SEXYPSF";

/* Plugin Settings - GBSPlay */
"GBS" = "GBS";

/* Plugin Settings - STSOUND */
"STSOUND" = "STSOUND";

/* Plugin Settings - SC68 */
"SC68" = "SC68";

/* Additional Settings */
"Disable" = "비활성화";
"Enter playlist name" = "재생목록 이름 입력";
"Ask" = "묻기";
"Play All" = "모두 재생";
"Single" = "단일";
"Archive" = "압축 파일";
"On" = "켬";
"Off" = "끔";
"Lim" = "제한";

// ==================================
// MARK: - PLAYLISTS - ADDITIONAL ENTRIES
// ==================================

/* Playlist Menu Entries */
"Add a playlist" = "재생목록 추가";
"Create a new playlist" = "새 재생목록 만들기";
"Now playing" = "지금 재생 중";
"1 entry" = "1개 항목";
"No entry" = "항목 없음";
"Random picks" = "무작위 선택";
"Generate a randomized playlist" = "무작위 재생목록 생성";
"Most played" = "가장 많이 재생됨";
"Favorites" = "즐겨찾기";

/* Playlist Actions */
"Add/Remove files..." = "파일 추가/제거...";
"More actions..." = "더 많은 작업...";
"Save as a new playlist" = "새 재생목록으로 저장";

// ==================================
// MARK: - WELCOME PAGES
// ==================================

"Welcome to Modizer!\n" = "Modizer에 오신 것을 환영합니다!\n";
"Level up your library." = "라이브러리를 업그레이드하세요.";
"Sound meets visuals." = "사운드가 비주얼을 만납니다.";
"Made with passion,\noffered for free." = "열정으로 만들고,\n무료로 제공합니다.";

/* Welcome Page Messages */
"Your gateway to retro and tracker music.\nPower up your device with legendary game tunes, iconic tracker modules, and timeless chiptune classics." = "레트로 및 트래커 음악의 관문입니다.\n전설적인 게임 음악, 상징적인 트래커 모듈, 시대를 초월한 칩튠 클래식으로 기기를 강화하세요.";

"Browse and stream from online catalogs, to complete your own collections.\nBuild, edit, and listen to playlists effortlessly." = "온라인 카탈로그에서 검색하고 스트리밍하여 자신만의 컬렉션을 완성하세요.\n재생목록을 쉽게 만들고, 편집하고, 들으세요.";

"Unlock classic oscilloscope looks, spectrum bars, piano rolls, trackers view and ProjectM/Milkdrop FX. Let Modizer paint each track with motion and color." = "클래식 오실로스코프 모양, 스펙트럼 바, 피아노 롤, 트래커 뷰 및 ProjectM/Milkdrop FX를 잠금 해제하세요. Modizer가 각 트랙을 움직임과 색상으로 칠하도록 하세요.";

"If you enjoy the app, tips are a great way to support its ongoing development.\nThank you for helping keep Modizer alive and evolving." = "앱이 마음에 드신다면 팁은 지속적인 개발을 지원하는 좋은 방법입니다.\nModizer를 계속 유지하고 발전시키는 데 도움을 주셔서 감사합니다.";

"Skip" = "건너뛰기";

// ==================================
// MARK: - TIPS / DONATIONS
// ==================================

/* Tips Screen */
"Support with a Tip" = "팁으로 지원하기";
"Enjoy Modizer ?" = "Modizer가 마음에 드시나요?";
"Your support helps keep Modizer running and ad-free!" = "여러분의 지원으로 Modizer가 계속 실행되고 광고 없이 유지됩니다!";
"Already tipped so far" = "지금까지 후원한 금액";
"Thank you for your support! 🙏" = "지원해 주셔서 감사합니다! 🙏";

/* Tip Tiers */
"Coffee" = "커피";
"Coffee & Croissant" = "커피 & 크루아상";
"Dinner" = "저녁 식사";
"Loading..." = "로딩 중...";

/* Tip Actions */
"Confirm Tip" = "팁 확인";
"Send Tip" = "팁 보내기";
"Send a %@ tip for %@?" = "%@에 대해 %@ 팁을 보내시겠습니까?";
"Tip" = "팁";

/* Tip Errors */
"Unable to load products. Please check your internet connection." = "제품을 로드할 수 없습니다. 인터넷 연결을 확인하세요.";

/* Thank You Alert */
"Thank You! 🙏" = "감사합니다! 🙏";
"Your support means everything! Thank you for helping keep Modizer running." = "여러분의 지원이 전부입니다! Modizer를 계속 실행하도록 도와주셔서 감사합니다.";

// ==================================
// MARK: - MAINTENANCE SCREEN
// ==================================

/* Maintenance Actions */
"Clean Database" = "데이터베이스 정리";
"Clear 'Now Playing' queue" = "'지금 재생 중' 대기열 지우기";
"Recreate Samples folder" = "Samples 폴더 재생성";
"Reset settings to default" = "설정을 기본값으로 초기화";
"Remove current cover" = "현재 커버 제거";
"Reset Ratings" = "평가 초기화";
"Reset Played Counters" = "재생 횟수 초기화";
"Reset Database" = "데이터베이스 초기화";
"Clear images cache" = "이미지 캐시 지우기";

/* Maintenance Messages */
"Settings reseted" = "설정 초기화됨";
"Ratings reseted" = "평가 초기화됨";
"Played Counters reseted" = "재생 횟수 초기화됨";
"Samples folder created" = "Samples 폴더 생성됨";
"Cache cleaned" = "캐시 정리됨";
"Database reseted" = "데이터베이스 초기화됨";
"No cover to remove" = "제거할 커버 없음";
"Cover removed" = "커버 제거됨";
"Database cleaned" = "데이터베이스 정리됨";

/* Maintenance Confirmations */
"Are you sure you want to clean the DB, it might take a while ?" = "DB를 정리하시겠습니까? 시간이 걸릴 수 있습니다.";
"Clean" = "정리";
"Cleaning DB" = "DB 정리 중";
"Cancelling..." = "취소 중...";

// ==================================
// MARK: - PLAYERMENU
// ==================================

"Close FX\nwindow" = "FX\n창 닫기";
"All FX off" = "모든 FX 끔";
"FX\nalpha" = "FX\n알파";
"Show name\ntemp." = "이름\n임시 표시";
"Show name" = "이름 표시";
"Bundled\npresets" = "번들\n프리셋";
"Custom\npresets" = "사용자\n프리셋";
"Blend\npresets" = "프리셋\n혼합";
"Clear\nall" = "모두\n지우기";
"Select\nall" = "모두\n선택";
"Favorites" = "즐겨찾기";
"Expand" = "확장";
"Select\nlisted" = "목록\n선택";
"Remove\nlisted" = "목록\n제거";
"Selected" = "선택됨";
"Collapse" = "축소";
"Labels" = "레이블";
"Grid" = "그리드";
"Voices\nlabels" = "음성\n레이블";
"Octaves\nlabels" = "옥타브\n레이블";
"Volume\nbars" = "볼륨\n바";
"Fixed bar" = "고정 바";
"BG\nopacity" = "BG\n불투명도";
"Bloom:\n%s" = "블룸:\n%s";
"Thickness:\n%s" = "두께:\n%s";
"Font size\n%s" = "글꼴 크기\n%s";
"Font:\n%s" = "글꼴:\n%s";
"Info HUD:\n%s" = "정보 HUD:\n%s";
"Select active %s presets" = "활성 %s 프리셋 선택";
"bundled" = "번들";
"custom" = "사용자 정의";
"Select\ncustom\npresets" = "사용자 정의\n프리셋\n선택";
"Select\nbundled\npresets" = "번들\n프리셋\n선택";
"Themes:\n%s" = "테마:\n%s";

// MARK: - Voice Commands phrases
"Play some music in Modizer" = "Modizer에서 음악 재생";
"Start random playlist in Modizer" = "Modizer에서 무작위 재생";
"Play favorites in Modizer" = "Modizer에서 즐겨찾기 재생";
"Start favorites playlist in Modizer" = "Modizer에서 좋아하는 음악 재생";
"Play most played in Modizer" = "Modizer에서 가장 많이 재생된 곡 재생";
"Start most played playlist in Modizer" = "Modizer에서 인기곡 재생";
"Play a playlist in Modizer" = "Modizer에서 재생목록 재생";
"Start a playlist in Modizer" = "Modizer에서 플레이리스트 시작";
"Toggle shuffle mode in Modizer" = "Modizer에서 셔플 모드 전환";
"Change shuffle mode in Modizer" = "Modizer에서 무작위 재생 변경";
"Change loop mode in Modizer" = "Modizer에서 반복 모드 변경";
"Toggle repeat in Modizer" = "Modizer에서 반복 재생 전환";
"What's playing in Modizer" = "Modizer에서 재생 중인 곡";
"Current song in Modizer" = "Modizer의 현재 곡";

"Voices commands aren't supported in MacOS." = "macOS에서는 음성 명령이 지원되지 않습니다.";

/* Error messages */
"playlist_not_found_error" = "재생목록을 찾을 수 없습니다. '재생목록 가져오기'를 사용하여 사용 가능한 재생목록을 확인하세요.";
"playlist_empty_error" = "이 재생목록에 항목이 없습니다. 먼저 음악을 추가하세요.";

"%@ (name)" = "%@ (이름)";
 "%@ (packs)" = "%@ (팩)";
 "%@ (rating)" = "%@ (평점)";
 "2D Spectrum settings" = "2D 스펙트럼 설정";
 "3D landscape settings" = "3D 풍경 설정";
 "3D spectrum settings" = "3D 스펙트럼 설정";
 "Auto\nscaling" = "자동\n크기 조절";
 "CGSC collection" = "CGSC 컬렉션";
 "Cleaning DB & \nreseting settings" = "DB 정리 &\n설정 초기화";
 "CoverLibraryFolder" = "현재 라이브러리 폴더 커버로";
 "Feeling lucky" = "행운을 빌어요";
 "Hide MIDI & Piano FX" = "MIDI & 피아노 FX 숨기기";
 "Hide other note based FX if displayed (Piano, Midi)" = "표시된 경우 다른 노트 기반 FX 숨기기 (Piano, Midi)";
 "JoshW Covers" = "JoshW 커버";
 "Limit applied in Radio mode to avoid downloading too big files." = "너무 큰 파일 다운로드를 방지하기 위해 라디오 모드에서 제한이 적용됩니다.";
 "MIDI pattern settings" = "MIDI 패턴 설정";
 "MOD Pattern settings" = "MOD 패턴 설정";
 "Next: %@" = "다음: %@";
 "Next: loading..." = "다음: 로딩 중...";
 "Piano 3D settings" = "3D 피아노 설정";
 "Piano roll settings" = "피아노 롤 설정";
 "Radio download limit" = "라디오 다운로드 제한";
 "Radio mode" = "라디오 모드";
 "Search: simplified regexp ('.'->'\\.', '*'->'.*')" = "검색: 간소화된 정규표현식 ('.'->'\\.', '*'->'.*')";
 "Thank You! ❤️" = "감사합니다! ❤️";
 "Thank you for your support! ❤️" = "지원해 주셔서 감사합니다! ❤️";
 "Try to download covers from TGDB or MobyGames." = "TGDB 또는 MobyGames에서 커버를 다운로드해 보세요.";

/* Cloud */
  "Add Cloud Source" = "클라우드 소스 추가";
  "Browse iCloud, Dropbox, ..." = "iCloud, Dropbox, 탐색...";
  "Name this source" = "이 소스 이름 지정";
  "Enter a name for this cloud folder" = "이 클라우드 폴더의 이름을 입력하세요";
  "Cloud Folder" = "클라우드 폴더";
  "Add" = "추가";
  "This cloud folder was added but may not persist after the app is closed. Some cloud providers don't support persistent access." = "이 클라우드 폴더가
  추가되었지만 앱을 닫으면 유지되지 않을 수 있습니다. 일부 클라우드 제공업체는 영구 액세스를 지원하지 않습니다.";
  "File cannot be downloaded.\nPlease check your internet connection." = "파일을 다운로드할 수 없습니다.\n인터넷 연결을 확인해 주세요.";
  "Downloading from\ncloud..." = "클라우드에서\n다운로드 중...";
  "Download timed out. Please try again later." = "다운로드 시간이 초과되었습니다. 나중에 다시 시도해 주세요.";
  "available" = "사용 가능";

"Copy" = "복사";
"Database couldn't be updated." = "데이터베이스를 업데이트할 수 없습니다.";
"Database updated." = "데이터베이스가 업데이트되었습니다.";
"Issue %d while copying: %@.\n%@" = "복사 중 오류 %d: %@.\n%@";
"Old database version: %d.%d. Will update to %d.%d. Please validate & wait." = "이전 데이터베이스 버전: %d.%d. %d.%d로 업데이트됩니다. 확인 후 기다려
주세요.";
"Use STIL data" = "STIL 데이터 사용";
"Used for subsongs titles and related artists names." = "서브송 제목 및 관련 아티스트 이름에 사용됩니다.";

